frontend/controllers/SiteController.php

SELECT `Customer`.`id`, `Customer`.`name`, `Customer`.`logo` FROM `vk_user_brand` `UserBrand` LEFT JOIN `vk_customer` `Customer` ON Customer.id = UserBrand.brand_id WHERE (`user_id`='c8ed14d56e36d57a1b69786f883f21e3') AND (`is_del`=0) ORDER BY `Customer`.`sort_order`
SELECT * FROM `vk_user` WHERE `id`='c8ed14d56e36d57a1b69786f883f21e3'
---
    public function actionSwitchCustomer()
    {
        /* 用户关联的所有品牌 */
        $customers = (new Query())->select(['Customer.id','Customer.name','Customer.logo'])
            ->from(['UserBrand' => UserBrand::tableName()])
            ->leftJoin(['Customer' => Customer::tableName()], 'Customer.id = UserBrand.brand_id')
            ->where(['user_id' => Yii::$app->user->id, 'is_del' => 0])
            ->orderBy('Customer.sort_order')
            ->all();

        if(Yii::$app->request->isPost){
            Yii::$app->getResponse()->format = 'json';
            $message = '';
            $is_success = false;
            try
            {
                $relBrands = ArrayHelper::getColumn($customers, 'id');  //用户关联的所有品牌
                $userModel = User::findOne(Yii::$app->user->id);