common/models/BaseUser.php

SELECT * FROM `vk_user` WHERE (`id`='c8ed14d56e36d57a1b69786f883f21e3') AND (`status`=10)
---
    public static function findIdentity($id) {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `vk_user` WHERE ((`username`='wskeee') OR (`phone`='wskeee')) AND (`status`=10)
---
    public static function findByUsername($username) {
        return static::find()->where(['and', ['or', ['username' => $username], ['phone' => $username]], ['status' => self::STATUS_ACTIVE]])
                ->one();