common/models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {
            $userModel = $this->getUser();
            //检查客户是否到期停用 停用则不能登录
            if($userModel->type == User::TYPE_GROUP){
                $customer = Customer::findOne($userModel->customer_id);
                if($customer->status == Customer::STATUS_STOP){
                    Yii::$app->getSession()->setFlash('error', '客户套餐已到期！待管理员续费后可继续使用');
                    return false;
                }
            }
            $hasLogin = Yii::$app->user->login($userModel, $this->rememberMe ? 3600 * 24 * 30 : 0);
            if($hasLogin && $this->userClass == User::class){
                $this->_user->generateAccessToken();
                $this->_user->save(false);
---
SELECT * FROM `vk_customer` WHERE `id`='ebac30a5ccf50e6568c0cf88060f78eb'
UPDATE `vk_user` SET `access_token_expire_time`='1542596797', `updated_at`='1541991997' WHERE `id`='c8ed14d56e36d57a1b69786f883f21e3'