common/models/User.php

SELECT * FROM `vk_customer` WHERE `id`='ebac30a5ccf50e6568c0cf88060f78eb'
---
    public function checkMaxStore($attribute, $params)
    {
        if($this->type == self::TYPE_GROUP){  //团体用户才需要检测
            $format = $this->getAttribute($attribute) * $this->byte;
            $totalSize = Customer::findOne($this->customer_id);             //客户所拥有的存储空间