common/models/vk/CustomerAdmin.php

    public static function getIsAdminUser($customerId, $userId)
    {
        $users = self::findAll(['customer_id' => $customerId]);
---
SELECT * FROM `vk_customer_admin` WHERE `customer_id`='ebac30a5ccf50e6568c0cf88060f78eb'