common/models/vk/UserBrand.php

    public static function userBingding($user_id, $customer_id, $is_add = true) {
        //是否已保存关联
        $userBrand = UserBrand::findOne(['user_id' => $user_id, 'brand_id' => $customer_id]);

        //如果未发现关联品牌 并且是要增加的情况
        if ($userBrand == null && $is_add) {
            $userBrand = new UserBrand(['user_id' => $user_id, 'brand_id' => $customer_id]);
        }

        if ($is_add) {
            $userBrand->is_del = 0;
        } elseif ($userBrand != null) {
            $userBrand->is_del = 1;
        }

        return $userBrand == null ? true : $userBrand->save();
---
SELECT * FROM `vk_user_brand` WHERE (`user_id`='c8ed14d56e36d57a1b69786f883f21e3') AND (`brand_id`='12dc4b3aa671b4ad90a43a5fe01c2645')
UPDATE `vk_user_brand` SET `is_del`=0, `updated_at`='1541756944' WHERE `id`='538'