frontend/modules/user/controllers/DefaultController.php

    public function actionIndex()
    {
        $model = $this->findModel(Yii::$app->user->id);
        $weiboConfig = Yii::$app->params[self::$weiboConfig];       //获取微博登录的配置
        $weibo = new SaeTOAuthV2($weiboConfig['WB_AKEY'], $weiboConfig['WB_SKEY']);

        if($model->id != Yii::$app->user->id){
            throw new NotFoundHttpException(Yii::t('app', 'The requested page does not exist.'));
        }

        return $this->render('index', [
            'model' => $model,
            'userBrand' => User::getUserBrand($model->id),         //用户绑定的品牌
//            'usedSpace' => $this->getUsedSpace($model->id),               //用户已经使用的空间
            'userCouVid' => $this->getUserCouVid($model->id),             //用户自己创建的课程和视频
            'courseProgress' => $this->getCourseProgress($model->id),     //已学课程数
            'courseFavorite' => $this->getCourseFavorite($model->id),     //关注的课程数
            'videoFavorite' => $this->getVideoFavorite($model->id),       //收藏的视频数
            'courseMessage' => $this->getCourseMessage($model->id),       //评论数
//            'weibo_url' => $weibo->getAuthorizeURL($weiboConfig['WB_CALLBACK_URL']), //微博登录回调地址
//            'weiboUser' => UserAuths::findOne(['user_id' => $model->id, 'identity_type' => 'weibo']),  //是否已经绑定微博账号
//            'qqUser' => UserAuths::findOne(['user_id' => $model->id, 'identity_type' => 'qq']),        //是否已绑定QQ号
//            'wechatUser' => UserAuths::findOne(['user_id' => $model->id, 'identity_type' => 'wechat']),//是否已绑定微信账号
        ]);
---
SELECT * FROM `vk_user_auths` WHERE (`user_id`='c8ed14d56e36d57a1b69786f883f21e3') AND (`identity_type`='wechat')

    public function actionDelBingding($id)
    {
        $model = UserBrand::findOne($id);

        if ($model->load(Yii::$app->request->post())) {
            Yii::$app->getResponse()->format = 'json';
            if($model->brand_id == Yii::$app->user->identity->customer_id){
                $result = false;
                Yii::$app->getSession()->setFlash('error','删除失败！');
            } else {
                $model->is_del = 1;
                $result = $model->save(false, ['is_del']);
---
SELECT * FROM `vk_user_brand` WHERE `id`='538'
UPDATE `vk_user_brand` SET `is_del`=1 WHERE `id`='538'

    public function actionCustomer()
    {
        \Yii::$app->getResponse()->format = 'json';
        $post = \Yii::$app->request->post();
        $inviteCode = ArrayHelper::getValue($post, 'txtVal');   //获取输入的邀请码
        $customer = Customer::find()->select(['name'])->where(['invite_code' => $inviteCode])->asArray()->one(); //查找客户名
---
SELECT `name` FROM `vk_customer` WHERE `invite_code`='222222'

    public function addBingding($post)
    {
        $inviteCode = ArrayHelper::getValue($post, 'UserBrand.brand_id');   //客户邀请码
        $user_id = ArrayHelper::getValue($post, 'UserBrand.user_id');       //用户id
        $customer_id = Yii::$app->user->identity->customer_id;              //当前客户ID

        $brand_id = Customer::find()->select(['id'])
                ->where(['invite_code' => $inviteCode])->asArray()->one(); //查找客户id

        if($brand_id == null || $customer_id == $brand_id['id']){
            Yii::$app->getSession()->setFlash('error','操作失败！');
            return false;
        } else {
            $userBrand = UserBrand::findOne(['user_id' => $user_id, 'brand_id' => $brand_id['id']]);
---
SELECT `id` FROM `vk_customer` WHERE `invite_code`='222222'
SELECT * FROM `vk_user_brand` WHERE (`user_id`='c8ed14d56e36d57a1b69786f883f21e3') AND (`brand_id`='12dc4b3aa671b4ad90a43a5fe01c2645')

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `vk_user` WHERE `id`='c8ed14d56e36d57a1b69786f883f21e3'

    public function getUsedSpace($id)
    {
        $userSize = (new Query())
                ->select(['SUM(size) AS size'])
                ->from(['Uploadfile' => Uploadfile::tableName()])
                ->where(['is_del' => 0])
                ->andFilterWhere(['created_by' => $id])
                ->one();
---
SELECT SUM(size) AS size FROM `vk_uploadfile` `Uploadfile` WHERE (`is_del`=0) AND (`created_by`='c8ed14d56e36d57a1b69786f883f21e3')

    public function getUserCouVid($user_id)
    {
        //查询用户创建课程数量
        $userCou = (new Query())->select(['COUNT(Course.id) AS course_num'])
                ->from(['Course' => Course::tableName()])
                ->where(['Course.is_del' => 0])
                ->andFilterWhere(['Course.created_by' => $user_id])
                ->one();
        //查询用户创建视频数量
        $userVid = (new Query())->select(['COUNT(Video.id) AS video_num'])
                ->from(['Video' => Video::tableName()])
                ->where(['Video.is_del' => 0])
                ->andFilterWhere(['Video.created_by' => $user_id])
                ->one();
---
SELECT COUNT(Course.id) AS course_num FROM `vk_course` `Course` WHERE (`Course`.`is_del`=0) AND (`Course`.`created_by`='c8ed14d56e36d57a1b69786f883f21e3')
SELECT COUNT(Video.id) AS video_num FROM `vk_video` `Video` WHERE (`Video`.`is_del`=0) AND (`Video`.`created_by`='c8ed14d56e36d57a1b69786f883f21e3')

    public function getCourseProgress($user_id)
    {
        $courseProgress = (new Query())
                ->select(['COUNT(CourseProgress.user_id) AS cou_pro_num'])
                ->from(['CourseProgress' => CourseProgress::tableName()])
                ->where(['is_finish' => 1])
                ->andFilterWhere(['user_id' => $user_id,])
                ->one();
---
SELECT COUNT(CourseProgress.user_id) AS cou_pro_num FROM `vk_course_progress` `CourseProgress` WHERE (`is_finish`=1) AND (`user_id`='c8ed14d56e36d57a1b69786f883f21e3')

    public function getCourseFavorite($user_id)
    {
        $courseFavorite = (new Query())
                ->select(['COUNT(CourseFavorite.user_id) AS cou_fav_num'])
                ->from(['CourseFavorite' => CourseFavorite::tableName()])
                ->where(['is_del' => 0])
                ->andFilterWhere(['user_id' => $user_id])
                ->one();
---
SELECT COUNT(CourseFavorite.user_id) AS cou_fav_num FROM `vk_course_favorite` `CourseFavorite` WHERE (`is_del`=0) AND (`user_id`='c8ed14d56e36d57a1b69786f883f21e3')

    public function getVideoFavorite($user_id)
    {
        $videoFavorite = (new Query())
                ->select(['COUNT(VideoFavorite.user_id) AS vid_fav_num'])
                ->from(['VideoFavorite' => VideoFavorite::tableName()])
                ->where(['is_del' => 0])
                ->andFilterWhere(['user_id' => $user_id])
                ->one();
---
SELECT COUNT(VideoFavorite.user_id) AS vid_fav_num FROM `vk_video_favorite` `VideoFavorite` WHERE (`is_del`=0) AND (`user_id`='c8ed14d56e36d57a1b69786f883f21e3')

    public function getCourseMessage($user_id)
    {
        $courseMessage = (new Query())
                ->select(['COUNT(CourseMessage.user_id) AS cou_mes_num'])
                ->from(['CourseMessage' => CourseMessage::tableName()])
                ->where(['user_id' => $user_id])
                ->one();
---
SELECT COUNT(CourseMessage.user_id) AS cou_mes_num FROM `vk_course_message` `CourseMessage` WHERE `user_id`='c8ed14d56e36d57a1b69786f883f21e3'